export interface AdvancedRefineTable {
  amount: Record<string, number>;
  breath: Record<string, number>;
  book?:
    | "장인의 야금술 : 1단계"
    | "장인의 야금술 : 2단계"
    | "장인의 재봉술 : 1단계"
    | "장인의 재봉술 : 2단계"
    | undefined;
}

export const advancedRefineTable: Record<
  "armor" | "weapon",
  Record<string, AdvancedRefineTable>
> = {
  armor: {
    tier3_1: {
      amount: {
        정제된수호강석: 475,
        찬명돌: 11,
        최상급오레하: 9,
        파편: 4400,
        골드: 760,
      },
      breath: {
        은총: 12,
        축복: 6,
        가호: 2,
      },
      book: "장인의 재봉술 : 1단계",
    },
    tier3_2: {
      amount: {
        정제된수호강석: 650,
        찬명돌: 14,
        최상급오레하: 10,
        파편: 8800,
        골드: 1440,
      },
      breath: {
        은총: 18,
        축복: 9,
        가호: 3,
      },
      book: "장인의 재봉술 : 2단계",
    },
    tier4_1: {
      amount: {
        운명의수호석: 250,
        운돌: 6,
        아비도스: 7,
        운명파편: 2400,
        골드: 760,
      },
      breath: {
        빙하: 6,
      },
      book: "장인의 재봉술 : 1단계",
    },
    tier4_2: {
      amount: {
        운명의수호석: 450,
        운돌: 8,
        아비도스: 8,
        운명파편: 4800,
        골드: 1440,
      },
      breath: {
        빙하: 9,
      },
      book: "장인의 재봉술 : 2단계",
    },
    tier4_3: {
      amount: {
        운명의수호석: 1000,
        운돌: 18,
        아비도스: 17,
        운명파편: 7000,
        골드: 2000,
      },
      breath: {
        빙하: 20,
      },
    },
    tier4_4: {
      amount: {
        운명의수호석: 1200,
        운돌: 23,
        아비도스: 19,
        운명파편: 8000,
        골드: 2400,
      },
      breath: {
        빙하: 24,
      },
    },
  },
  weapon: {
    tier3_1: {
      amount: {
        정제된파괴강석: 500,
        찬명돌: 14,
        최상급오레하: 15,
        파편: 7200,
        골드: 900,
      },
      breath: {
        은총: 12,
        축복: 6,
        가호: 2,
      },
      book: "장인의 야금술 : 1단계",
    },
    tier3_2: {
      amount: {
        정제된파괴강석: 800,
        찬명돌: 18,
        최상급오레하: 16,
        파편: 13600,
        골드: 2000,
      },
      breath: {
        은총: 18,
        축복: 9,
        가호: 3,
      },
      book: "장인의 야금술 : 2단계",
    },
    tier4_1: {
      amount: {
        운명의파괴석: 300,
        운돌: 8,
        아비도스: 12,
        운명파편: 4000,
        골드: 900,
      },
      breath: {
        용암: 6,
      },
      book: "장인의 야금술 : 1단계",
    },
    tier4_2: {
      amount: {
        운명의파괴석: 550,
        운돌: 11,
        아비도스: 13,
        운명파편: 8000,
        골드: 2000,
      },
      breath: {
        용암: 9,
      },
      book: "장인의 야금술 : 2단계",
    },
    tier4_3: {
      amount: {
        운명의파괴석: 1200,
        운돌: 25,
        아비도스: 28,
        운명파편: 11500,
        골드: 3000,
      },
      breath: {
        용암: 20,
      },
    },
    tier4_4: {
      amount: {
        운명의파괴석: 1400,
        운돌: 32,
        아비도스: 30,
        운명파편: 13000,
        골드: 4000,
      },
      breath: {
        용암: 24,
      },
    },
  },
};
